       01 REG-CTA.                                                      00010000
           03 IDCONTA         PIC 9(04).                                00020000
           03 NOME            PIC X(30).                                00030000
           03 SALDOINI        PIC 9(10)V9(02).                          00040000
           03 FILLER          PIC X(56).                                00050000
