       01 REG-TANS.                                                     00010000
           03 DATA            PIC 9(08).                                00020000
           03 TIPO            PIC 9(01).                                00030000
           03 VALOR           PIC 9(05)V9(02).                          00040000
           03 DESCR           PIC X(05).                                00050000
           03 IDCONTA         PIC 9(04).                                00060000
           03 FILLER          PIC X(17).                                00070000
